# Виведіть повідомлення Hello, Python! на екран n разів (n - ціле число, яке вводить користувач).

# n = int(input('enter: '))
# i = 1
# while i <= n:
#    print('Hello, Python!')
#    i = i + 1

# Дано два цілих числа a і b (a ≤ b). Виведіть всі числа від a до b включно.

# a = 1
# b = 12
# for i in range(a, b+1):
#    print(i)

# Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.

# import time
# n = int(input('enter: '))
# while n != 0:
#     print(n)
#     n -= 1
#     time.sleep(1)
# print('start')

# Користувач вводить кількість навчальних предметів n, а потім, відповідно, оцінки учня з n навчальних предметів. Визначте середню оцінку.

# a = int(input("eneter: "))
# sub = 1
# res = 0
# for i in range(0, a):
#     b = int(input(f'Enter {sub} points amount: '))
#     res = res + b
#     sub += 1
# f_res = res / (sub - 1)
# print(f_res)

# Надрукувати у рядку m разів число n. Числа m і n - цілі числа, які вводить користувач у порядку n, m.

# n = int(input("enter n: "))
# m = int(input("enter m: "))
# for i in range(m):
#     print(n, end=' ')

# Напишіть програму для виведення усіх цілих чисел від 20 до n включно (n > 20), де n - ціле число, яке вводить користувач.

# n = int(input('enter: '))
# for i in range(20, n+1):
#     print(i)

# Напишіть програму для друку цілих чисел від n до 0 із виведенням біля кожного числа кількості символів #, що дорівнює значенню числа.

# n = int(input('enter n: '))
# while n != 0:
#     print(n, '#' * n)
#     n -= 1

# Визначити суму всіх чисел від 1 до n (1 ≤ n ≤ 100)
# import sys
# n = int(input('enter n: '))
# a = n
# if 1 <= n <= 100:
#     for i in range(n):
#         a = a + i
# else:
#     print('number should b in range 1 to 100')
#     sys.exit()
# print(a)

# Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням n.

# n = int(input('enter n: '))
# for i in range(n + 1):
#     print(str(i) * i)

# Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням n

# n = int(input('enter n: '))
# while n != 0:
#     a = '*' * n
#     n -= 1
#     print(a)

# Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням n.

# n = int(input('enter n: '))
# for i in range(n):
#     a = '#' + ' ' * i + '#'
#     print(a)

# Напишіть програму, яка підраховує додатні і від’ємні числа, а також нулі, введені користувачем, і виводить їхню кількість в один рядок з одним пропуском між ними.

# n = input('enter n: ').split()
# pos = 0
# neg = 0
# zero = 0
# for i in n:
#     i = int(i)
#     if i > 0:
#         pos += 1
#     if i < 0:
#         neg += 1
#     if i == 0:
#         zero += 1
# print(pos, zero, neg)

# Напишіть програму, яка друкує в дному рядку через пропуск усі парні числа від 1 до n (1 < n ≤ 100, n - ціле число, яке вводить користувач).
# Використайте оператор continue.

# n = int(input('enter n: '))
# if 1 < n <= 100:
#     for i in range(1, n + 1):
#         if i % 2 != 0:
#             continue
#         print(i, end=' ')

# Надрукувати всі цілі числа від a до b включно, кратні деякому числу c. Числа a, b, c - цілі числа, які вводить користувач.

# a = int(input('enter a: '))
# b = int(input('enter b: '))
# c = int(input('enter c: '))
# for i in range(a -1, b + 1):
#     if i % c == 0:
#         print(i, end=' ')

# Дано натуральне ціле додатнє число n. Визначити кількість цифр в ньому.

# a = int(input('enter a: '))
# a = str(a)
# b = 0
# for i in a:
#     b += 1
# print(b)

# Надрукувати квадрати усіх цілих чисел від 1 до n включно (значення n вводиться з клавіатури користувачем).

# n = int(input('enter n: '))
# i = 0
# for i in range(1, n + 1):
#     print(i**2)

# Напишіть програму для друку чисел від 0 до n включно і виведення в один рядок через один пропуск (n - ціле число, яке вводить користувач).
# n = int(input('enter n: '))
# for i in range(0, n + 1):
#    print(i, end=' ')

# Надрукувати таблицю відповідності між масою у фунтах і масою в кілограмах для значень n фунтів (1 фунт = 453 г) у вигляді таблиці.

# n = int(input('enter n: '))
# for i in range(1, n + 1):
#     res = i * 0.453
#     res = round(res, 2)
#     print(f'{i:<3}     {res}')

# Напишіть програму, яка друкує цілі числа від 1 до n (1 < n ≤ 1000) з такою умовою:
# для чисел кратних 3 виводить *3* замість числа,
# для чисел кратних 5 друкує *5*, а
# для чисел, які кратні 3 і 5 одночасно, повідомлення буде *35*.

# try:
#     n = int(input('enter n - (1 < n ≤ 1000) : '))
#     if 1 < n <= 1000:
#         for i in range(1, n + 1):
#             if i % 3 == 0 and i % 5 == 0:
#                 print('*35*')
#                 continue
#             elif i % 3 == 0:
#                 print('*3*')
#                 continue
#             elif i % 5 == 0:
#                 print("*5*")
#             else:
#                 print(i)
#     else:
#         print('invalid value')
# except ValueError:
#     print('xyiina')

# Напишіть програму, яка зчитує цілі числа, введені користувачем, по одному числу n в рядку.
# Для кожного введеного числа необхідно перевірити: якщо число менше 10, то пропускаємо це число;
# якщо число більше 100, то припиняємо зчитувати числа; в інших випадках вивести це число в окремому рядку.

# i = int(input('enter i: '))
# while i in range(0, 100):
#     if i < 10:
#         i = int(input('enter i: '))
#     elif 10 <= i <= 100:
#         print(i)
#         i = int(input('enter i: '))

#  Напишіть програму для створення таблиці множення (від 1 до 10) для введеного цілого числа n.

# n = int(input('enter n: '))
#
# for i in range(1,11):
#     print(f'{n} x {i} = {n * i}')

# Знайти суму 1**2 + 2**2 + 3**2 + … + n2 при заданому користувачем значенні цілого числа n.
# n = int(input('enter n: '))
# res = 0
# b = 0
# for i in range(0, n + 1):
#     b = i ** 2
#     res = res + b
# print(res)

# Пароль доступу до комп’ютера зберігається у змінній n - ціле число, яке вводить користувач.
# Напишіть програму, яка запитує пароль в користувача. У разі введення користувачем неправильного пароля на екран має виводитися повідомлення Error,
# після чого дії повинні повторюватися до введення правильного значення. При успішній аутентифікації в ситемі має з’явитися повідомлення Done.

# n = 12345
# try:
#     i = int(input('enter i: '))
#     while i != n:
#         print('Error')
#         i = int(input('enter i: '))
#     print('done')
# except ValueError:
#     print('format')

# Система відслідковування помилок в комп’ютерній програмі збирає помилки щодня протягом n днів.
# Напишіть програму, яка знаходить загальну кількість помилок, зібраних протягом n днів.
# Користувач вводить кількість днів роботи системи відслідковування помилок n і вводить кількість помилок m щодня (n і m - цілі числа).

# n = int(input('enter days amount: '))
# m = 0
# total_error = 0
# for i in range(1, n + 1):
#     total_error = total_error + m
#     m = int(input('enter error amount: '))
# print(total_error)

# Біг на біговій доріжці дозволяє спалювати n калорій за хвилину.
# Напишіть програму, щоб відобразити кількість калорій, спалених протягом 10, 15, 20, 25 і 30 хвилин.

# n = float(input('enter calories amount: '))
# k = 31
# for i in range(10, k, 5):
#     print(i * n)

# Напишіть програму, яка виводить таблицю цілих значень температури не більше t (t ≥ 0) в градусах Цельсія (C)
# і відповідні значення за шкалою Фаренгейта (F) (F = 9*C/5 + 32).

# t = 11
# f = 0
# for i in range(0, t):
#     f = 9 * i / 5 +32
#     print(f'{i:<2} 	 {f:.2f}')

# Напишіть програму для побудови шаблону як у вихідних даних за введеними значеннями n і m.

# n = int(input('enter n: '))
# m = int(input('enter m: '))
# for i in range(0, n + 1):
#     print(f'{str(i):<4}' * m)

# Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням n = 7.
# 1  2 	3 	4 	5 	6 	7
# 2  3 	4 	5 	6 	7
# 3  4 	5 	6 	7
# 4  5 	6 	7
# 5  6  7
# 6  7
# 7
# n = 111
# for i in range(1, n + 1):
#     for j in range(i, n + 1):
#         print(f"{j:2}", end=" ")

# Дано два цілих числа a і b. Виведіть всі числа від a до b включно, в порядку зростання, якщо a < b, або в порядку спадання у іншому випадку.
# a = int(input('enter a: '))
# b = int(input('enter b: '))
# if a > b:
#     for i in range(a, b - 1, -1):
#         print(i, end=' ')
# else:
#     for i in range(a, b + 1):
#         print(i, end=' ')

# Дано n чисел. Перше число на вході n, після чого задано n цілих чисел.
# Необхідно порахувати кількість нулів серед введених користувачем чисел.
# n = int(input('enter n: '))
# total_zero = 0
# for i in range(n):
#     b = int(input())
#     if b == 0:
#         total_zero += 1
# print(total_zero)

# Надрукувати усі двоцифрові числа, сума квадратів цифр яких ділиться на n націло.
# Число n - ціле число, яке вводить користувач.
# n = int(input('enter n: '))
# for i in range(9, 100):
#     ten = i // 10
#     dig = i % 10
#     square = ten ** 2 + dig ** 2
#     if square % n == 0:
#         print(str(ten) + str(dig))

# Напишіть програму, яка друкує усі непарні числа з інтервалу [1, b], де b - ціле число, яке вводить користувач.
# Не можна використовувати конструкцію розгалуження.

# n = int(input('enter b: '))
# for i in range(1, b + 1):
#    while i % 2 != 0:
#        print(i, end=' ')
#        i += 1

# За даним цілим додатнім числом n обчисліть n! - значення факторіалу цього числа.
# b = int(input('enter b: '))
# res = 1
# for i in range(1, b + 1):
#     res = res * i
# print(res)

# Дано ціле число n, яке вводить користувач. Необхідно обчислити значення виразу 1! +2! +3! + …​ + n!
# n = int(input('enter n: '))
# i = 1
# res = 1
# total = 0
# while i <= n:
#     res = res * i
#     total = total + res
#     i += 1
# print(total)

# Користувач вводить n-цифрове ціле число.
# Необхідно вивести числа, утворені із введеного, відкиданням останньої цифри з кожного попереднього числа.
# n = int(input('enter n: '))
# n = n // 10
# while n > 0:
#     print(n)
#     n //= 10

# Напишіть програму, на вхід якої безперервно (у циклі) подаються введені користувачем дані.
# При введенні будь-яких даних, окрім цілих числел, виводиться повідомлення про помилку за допомогою генерування винятку ValueError.
# Як тільки ввели ціле число, виводиться повідомлення True і відбувається вихід з програми.
#
# while True:
#     try:
#         n = int(input('enter n: '))
#         print('True')
#         break
#     except ValueError:
#         print('This is not a integer number. Try again...')

# Дано натуральне число n. Надрукуйте всі n-значні непарні натуральні числа в порядку спадання.

# n = int(input('enter n: '))
# for i in range(n, 0, -1):
#     if i % 2 != 0:
#         print(i, end=' ')

# Дано натуральне число n. Визначити, чи є різниця його максимальної та мінімальної цифр парним числом.

# n = int(input('enter n: '))
# n = str(n)
# I = []
# for i in n:
#     I.append(int(i))
# a = max(I)
# b = min(I)
# res = a - b
# if res % 2 == 0:
#     print('true')
# else:
#     print('false')

# Є монотонна послідовність, в якій кожне натуральне число k зустрічається рівно k разів: 1, 2, 2, 3, 3, 3, 4, 4, 4, 4, ....
# За введеним натуральним числом n виведіть перші n членів цієї послідовності.

# n = int(input("enter n: "))
# current_number = 1
# count = 0
# while count < n:
#     for _ in range(current_number):
#         print(current_number, end=" ")
#         count += 1
#         if count >= n:
#             break
#     current_number += 1

# Написати програму для обчислення суми цифр цілого числа n. Програма має враховувати, що на вхід може подаватися ціле від’ємне число.

# n = int(input("Введіть натуральне число n: "))
# n = abs(n)
# n = str(n)
# a = 0
# for i in n:
#     a = a + int(i)
# print(a)











